#День 3: Основные операции.

#1. Переменные с числами

a=15
b=4

#2. Примеры арифметических вычислений с числами

print("Арифметические операции с 15 и 4")
print("Сложение:", a, "+", b, "=", a+b)
print("Вычитание:", a, "-", b, "=", a-b)
print("Умножение:", a, "*", b, "=", a*b)
print("Деление:", a, "/", b, "=", a/b)
print("Целочисленное деление:", a, "//", b, "=", a//b)
print("Остаток от деления: ", a, "%", b, "=", a%b)
print("Возведение в степень: ", a, "**", b, "=", a**b)
print("")

#3. Переменные со строками

greeting="Привет"
person="Саша"

#4. Примеры арифметических вычеслений со строками

print("Арифметические операции со строками")
print(greeting+person)
print(person*3)
print("")

#5. Переменные для преобразования в другие типы

number_str="123"
number_float=45.8

#6. Пример преобразования типов

print("Практика преобразования типов")
print("Исходные данные переменных для преобразования:")
print("number_str = ", number_str, "и является типом ", type(number_str))
print("number_float = ", number_float, "и является типом ", type(number_float))
print("123+7=", int(number_str)+7)
print("Число 45.8 как целое: ", int(number_float), ", как строка: ", str(number_float))