#День 4: Ввод и вывод данных.

#1. Запросы для пользователя

name=input("Введите ваше имя:")
age=int(input("Введите свой возраст:"))
height=float(input("Введите ваш рост (в метрах):"))
city=input("Введите город где вы проживаете:")
print("")

#2. Вывод данных. Способ 1

print("=== Вывод через запятые ===")
print("Привет, ", name, "! Тебе ", age, "лет. Твой рост ", height, ". Ты проживаешь в ", city, ".")
print("")

#3. Вывод данных.Способ 2

print("=== Вывод через f-строки ===")
print(f"Привет, {name}! Тебе {age} лет. Твой рост {height}. Ты проживаешь в {city}.")
print("")

#4. Бонус: расчёт года рождения

current_year=2025
date_of_birth=current_year-age

print("=== Бонус: расчёт года рождения ===")
print(f"Ты родился в {date_of_birth} году.")