#День 6: Закрепление материала. Мини-проект.

#1. Собираем данные с пользователя (Анкета)

print("=== Анкета пользователя ===")
name=input("Введите ваше имя: ")
age=int(input("Введите свой возраст: "))
height=float(input("Введите свой рост (в метрах): "))
favorite_color=input("Введите свой любимый цвет: ")
mood=int(input("Оцените своё настроение (от 1 до 10): "))

#2. Анализируем данные и выводим

print("=== Результат анализа ===")
print(f"Привет, {name}!")
if age<13: #Проверка возраста
    print(f"Вам {age} лет. Возрастная категория: Ребёнок")
elif age<18:
    print(f"Вам {age} лет. Возрастная категория: Подросток")
elif age<60:
    print(f"Вам {age} лет. Возрастная категория: Взрослый")
else:
    print(f"Вам {age} лет. Возрастная категория: Пенсионер")
if height>1.8: #Проверка роста
    print(f"Ваш рост {height}. Вы высокий")
elif height<1.6:
    print(f"Ваш рост {height}. Вы невысокий")
else:
    print(f"Ваш рост {height}. Средний рост")
print(f"Ваш любимый цвет {favorite_color} - это отличный выбор!")
if mood>7: #Проверяем настроение
    print("Ваше настроение сегодня отличное!")
elif 7>=mood>=4:
    print("Ваше настроение сегодня нормальное!")
else:
    print("Ваше настроение сегодня плохое!")

#3. Выводим год рождение

current_year=2025
print(f"Год рождения: {current_year-age}")